tutorials/CFD/DeimWithResidual/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(1.00028 -0.000205828 0)
(1.00028 -0.000615401 0)
(1.00028 -0.00102394 0)
(1.00028 -0.00143467 0)
(1.00028 -0.00184723 0)
(1.00028 -0.00225982 0)
(1.00027 -0.00266769 0)
(1.00026 -0.00306044 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            movingWallVelocity;
        value           nonuniform List<vector> 
318
(
(9.82589e-05 1.70005e-05 -1.38778e-15)
(8.75984e-05 1.34273e-05 2.77556e-15)
(-8.75984e-05 1.34273e-05 1.05023e-21)
(-9.82589e-05 1.70005e-05 -1.96525e-21)
(-0.000250283 0.000443747 2.77556e-15)
(0.000255726 0.000434353 0)
(-0.000108356 2.0814e-05 0)
(-0.000255726 0.000434353 -1.38778e-15)
...
)
;
    }
}


// ************************************************************************* //
