tutorials/CFD/DeimWithResidual/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;
//EigenSolver spectra;

// Number of modes to output and to use for projection
//NmodesUout 50;
//NmodesUproj 10;
//NmodePUout 50;
//NmodesPproj 10;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

bcMethod penalty; //penalty
warning false;

debug 1;
//POD_U  Frobenius;
//POD_p  Frobenius;
//POD_S  Frobenius;

POD_R  Frobenius;


NU  10;
NP  8;
NS  30;
NR  20;


// second order time derivative
//word timeDerivativeSchemeOrder   second;
word timeDerivativeSchemeOrder   first;
